In [1]:
import pandas as pd
from datasets import load_dataset

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [3]:
df['job_country'].value_counts().head(20)

job_country
United States     206292
India              51088
United Kingdom     40375
France             39922
Germany            27694
Spain              25100
Singapore          23696
Sudan              21781
Netherlands        20631
Italy              17013
Canada             16029
Mexico             15139
Poland             14793
Portugal           14508
Australia          12955
South Africa       12414
Belgium            12078
Philippines        11786
Ireland            11162
Switzerland         9924
Name: count, dtype: int64

In [ ]:
df['job_country'].isin(['Croatia']).any() #searching for a certain country

True

In [10]:
us_jobs = df[df['job_country'] == 'United States']

In [12]:
us_jobs = us_jobs[us_jobs['salary_year_avg'].notna()]

In [19]:
us_jobs.groupby('job_title_short')['salary_year_avg'].agg(['median','min', 'max', 'count']).sort_values(by='median', ascending= False)

                             median      min       max  count
job_title_short
Senior Data Scientist      155500.0  45000.0  890000.0   1690
Senior Data Engineer       147500.0  35000.0  425000.0   1591
Data Scientist             127500.0  27000.0  960000.0   5922
Data Engineer              125000.0  15000.0  525000.0   4500
Senior Data Analyst        111175.0  30000.0  425000.0   1131
Machine Learning Engineer  106415.0  30000.0  325000.0    576
Software Engineer           99150.0  28000.0  375000.0    467
Cloud Engineer              90000.0  42000.0  280000.0     65
Data Analyst                90000.0  25000.0  650000.0   5451
Business Analyst            85000.0  16500.0  387460.0    610